In [1]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [5]:
vr1=pd.Series([4,8,15,16,23,42])
vr1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
type(vr1)

pandas.core.series.Series

In [7]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#      variable print it.

In [8]:
vr2=[1,2,3,4,5,6,7,8,9,10]

In [9]:
pd.Series(vr2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
# Q3. Create a Pandas DataFrame that contains the following data:

In [17]:
x={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}

In [18]:
pd.DataFrame(x)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

ANS=
--->In pandas, a DataFrame is a two-dimensional, tabular data structure that is commonly used for data manipulation and analysis. It can be thought of as a spreadsheet or a SQL table, where data is organized into rows and columns. Each column in a DataFrame can hold different data types, and you can perform various operations on the data, such as filtering, grouping, and aggregation.


-->On the other hand, a pandas.Series is a one-dimensional labeled array that is capable of holding data of any type. It is similar to a column in a DataFrame but lacks the two-dimensional structure. A Series is essentially a single column of data with an associated label (the index), and you can think of it as a specialized dictionary or an array.



EX: SERIES , DATAFRAME.

In [21]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}
pd.DataFrame(data)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [23]:
pd.Series([25, 30, 35], name='Age')

0    25
1    30
2    35
Name: Age, dtype: int64

In [24]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#     you give an example of when you might use one of these functions?

ANS = Pandas provides a wide range of functions and methods to manipulate data in a DataFrame. 

Here are some common functions you can use:

1 .Selection and Filtering:

loc[] and iloc[]:

Used for selecting rows and columns by label or integer location.
query(): Allows you to filter rows using SQL-like syntax.

EX: 


filtered_df = df[df['Age'] > 30]

2.Sorting:

sort_values(): Sorts the DataFrame by one or more columns.

EX: 

sorted_df = df.sort_values(by='Age')


3.Aggregation:

groupby(): Groups data based on one or more columns, allowing for aggregation operations like sum, mean, count, et

EX: 


avg_age_by_city = df.groupby('City')['Age'].mean()


4.Data Transformation:

apply(): Applies a function to each element, row, or column.
map(): Applies a mapping or dictionary to a Series.

EX: 

def double_age(age):
    return age * 2

df['Double_Age'] = df['Age'].apply(double_age)

In [26]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

ANS = In Pandas, both Series and DataFrame are mutable in nature, while Panel is not.

Here's a breakdown of their mutability:

Series: 

A pandas.Series is mutable, which means you can modify its elements, change the index labels, or even add new elements to it after it has been created. You can update values in a Series using indexing or other methods like .loc[] and .iloc[].

Example of modifying a Series:

In [28]:
s = pd.Series([1, 2, 3, 4])
s[2] = 99  
s[4] = 5
s

0     1
1     2
2    99
3     4
4     5
dtype: int64

DataFrame: 

A pandas.DataFrame is also mutable. You can modify the data within the DataFrame, add or remove columns, change column names, and perform various other operations to update its content.


Example of modifying a DataFrame:

In [31]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

df['A'] = [7, 8, 9]


df['C'] = [10, 11, 12]
df

   A  B   C
0  7  4  10
1  8  5  11
2  9  6  12

Panel:

pandas.Panel used to be a data structure in older versions of Pandas for handling three-dimensional data. However, it has been deprecated since Pandas version 0.25.0, and it is no longer part of the official Pandas library as of my last knowledge update in September 2021. If you are working with three-dimensional data, you should consider using other data structures like multi-index DataFrames.

In [32]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [5]:
sr={"s":pd.Series([1,2,3,4]),"r":pd.Series([5,6,8,9]),"e":pd.Series([10,11,12,13])}

In [6]:
pd.DataFrame(sr)

   s  r   e
0  1  5  10
1  2  6  11
2  3  8  12
3  4  9  13